case2_1/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    frontandback
    {
        type            empty;
    }
    upperwall
    {
        type            symmetry;
    }
    lowerwall
    {
        type            symmetry;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    pipe1
    {
        type            calculated;
        value           nonuniform List<scalar> 
176
(
12.0973
12.0973
15.2145
16.3801
12.5857
16.3625
12.5857
8.55267
...
)
;
    }
    pipe2
    {
        type            calculated;
        value           nonuniform List<scalar> 
176
(
11.4922
11.4922
17.0781
13.5207
15.3298
11.9661
10.863
10.7893
...
)
;
    }
}


// ************************************************************************* //
