case2_1/system/forceCoeffsIncompressible
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates lift, drag and moment coefficients by summing forces on
    specified patches for a case where the solver is incompressible (pressure
    is kinematic, e.g. m^2/s^2).

\*---------------------------------------------------------------------------*/

patches     (pipe1 pipe2);

magUInf     0.2;
lRef        0.02;
Aref        0.0002;

liftDir     (0 1 0);
dragDir     (1 0 0);

CofR        (0 0 0);
pitchAxis   (0 0 1);

#includeEtc "caseDicts/postProcessing/forces/forceCoeffs.cfg"

// ************************************************************************* //
